
/*  Copyright (C) 2016, Inria
    Author: Dumitru Potop-Butucaru.

    This file is part of RPi653. 

    RPi653 is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, version 3 of the License.

    RPi653 is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with Foobar.  If not, see <http://www.gnu.org/licenses/>.
 */
/* This file of RPi653 is based on the rpi-boot 
   software by John Cronin. Copyright notice of this
   software is provided below.
 */
   
/* Copyright (C) 2013 by John Cronin <jncronin@tysos.org>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/* Provides an interface to the EMMC controller and commands for interacting
 * with an sd card */

/* References:
 *
 * PLSS 	- SD Group Physical Layer Simplified Specification ver 3.00
 * HCSS		- SD Group Host Controller Simplified Specification ver 3.00
 *
 * Broadcom BCM2835 Peripherals Guide
 */

#include <libc/stddef.h>   // For size_t, which in my case should be uint32_t
#include <libc/stdlib.h>   // For malloc, free...
#include <libc/string.h>   // For memset, memcpy...
#include <librpi/mmio.h>   // For memory mapped I/O
#include <librpi/timer.h>    // For usleep
#include <libc/util.h>     // For unaligned access
#include <librpi/debug.h>  // For debug_print
#include <libc/assert.h>   // For assert
#include <librpi/mmap.h>   // For the EMMC_BASE
#include <librpi/mbox.h>   // For the routines called during power_cycle
#include <libc/arm-eabi.h> // For div and mod routines.
#include <libsdfs/fs.h>

//#define sd_debug_printf(...) debug_printf(__VA_ARGS__)
#define sd_debug_printf(...)


// Configuration options

// Enable 1.8V support
#define SD_1_8V_SUPPORT

// Enable 4-bit support
#define SD_4BIT_DATA

// SD Clock Frequencies (in Hz)
#define SD_CLOCK_ID         400000
#define SD_CLOCK_NORMAL     25000000
#define SD_CLOCK_HIGH       50000000
#define SD_CLOCK_100        100000000
#define SD_CLOCK_208        208000000

// Enable SDXC maximum performance mode
// Requires 150 mA power so disabled on the RPi for now
//#define SDXC_MAXIMUM_PERFORMANCE

// Enable SDMA support
//#define SDMA_SUPPORT

// SDMA buffer address
#define SDMA_BUFFER     0x6000
#define SDMA_BUFFER_PA  (SDMA_BUFFER + 0xC0000000)

// Enable card interrupts
//#define SD_CARD_INTERRUPTS

// Enable EXPERIMENTAL (and possibly DANGEROUS) SD write support
#define SD_WRITE_SUPPORT

// The particular SDHCI implementation
#define SDHCI_IMPLEMENTATION_GENERIC        0
#define SDHCI_IMPLEMENTATION_BCM_2708       1
#define SDHCI_IMPLEMENTATION                SDHCI_IMPLEMENTATION_BCM_2708

static char driver_name[] = "emmc";
// We use a single device name as there is only one card slot in the
// RPi
static char device_name[] = "emmc0";	

static uint32_t hci_ver = 0;
static uint32_t capabilities_0 = 0;
static uint32_t capabilities_1 = 0;

struct sd_scr {
  uint32_t    scr[2];
  uint32_t    sd_bus_widths;
  int         sd_version;
};

struct emmc_block_dev {
  struct block_device bd;
  uint32_t card_supports_sdhc;
  uint32_t card_supports_18v;
  uint32_t card_ocr;
  uint32_t card_rca;
  uint32_t last_interrupt;
  uint32_t last_error;

  struct sd_scr *scr;

  int failed_voltage_switch;

  uint32_t last_cmd_reg;
  uint32_t last_cmd;
  uint32_t last_cmd_success;
  uint32_t last_r0;
  uint32_t last_r1;
  uint32_t last_r2;
  uint32_t last_r3;

  void *buf;
  uint32_t blocks_to_transfer;
  size_t block_size;
  int use_sdma;
  int card_removal;
  uint32_t base_clock;
};

/* Most of this data structure is taken from the document
   BCM2835-ARM-Peripherals.pdf. The only exceptions are 
   registers CAPABILITIES_0 and CAPABILITIES_1, which are
   not mentioned in the document, but are used in the 
   rpi-boot sources and are used in the implementation of
   both the generic mode and the raspberry-specific one.
   To make a difference, I marked all registers coming
   from the document with a star.
*/
struct EMMCRegisters {
  uint32_t ARG2 ;              // 0x00 *
  uint32_t BLKSIZECNT ;	// 0x04 *
  uint32_t ARG1  ;	        // 0x08 *
  uint32_t CMDTM ;		// 0x0C *
  uint32_t RESP0 ;		// 0x10 *
  uint32_t RESP1 ;		// 0x14 *
  uint32_t RESP2 ;		// 0x18 *
  uint32_t RESP3 ;		// 0x1C *
  uint32_t DATA ;	        // 0x20 *
  uint32_t STATUS ;		// 0x24 *
  uint32_t CONTROL0 ;		// 0x28 *
  uint32_t CONTROL1 ;		// 0x2C *
  uint32_t INTERRUPT ;		// 0x30 *
  uint32_t IRPT_MASK ;		// 0x34 *
  uint32_t IRPT_EN ;		// 0x38 *
  uint32_t CONTROL2 ;		// 0x3C *
  uint32_t CAPABILITIES_0 ;	// 0x40 
  uint32_t CAPABILITIES_1 ;	// 0x44
  uint32_t UNUSED1[2] ;                 // 0x48
  uint32_t FORCE_IRPT ;        // 0x50 *
  uint32_t UNUSED2[7] ;                 // 0x54
  uint32_t BOOT_TIMEOUT ;	// 0x70 *
  uint32_t DBG_SEL ;		// 0x74 *
  uint32_t UNUSED3[2] ;                 // 0x78
  uint32_t EXRDFIFO_CFG ;	// 0x80 *
  uint32_t EXRDFIFO_EN ;	// 0x84 *
  uint32_t TUNE_STEP ;		// 0x88 *
  uint32_t TUNE_STEPS_STD ;	// 0x8C *
  uint32_t TUNE_STEPS_DDR ;	// 0x90 *
  uint32_t UNUSED4[0x17] ;              // 0x94
  uint32_t SPI_INT_SPT ;	// 0xF0 *
  uint32_t UNUSED5[2] ;                 // 0xF4
  uint32_t SLOTISR_VER ;	// 0xFC *
} ;

struct EMMCRegisters* emmc = (struct EMMCRegisters*)EMMC_BASE ;

#define SD_CMD_INDEX(a)		((a) << 24)
#define SD_CMD_TYPE_NORMAL	0x0
#define SD_CMD_TYPE_SUSPEND	(1 << 22)
#define SD_CMD_TYPE_RESUME	(2 << 22)
#define SD_CMD_TYPE_ABORT	(3 << 22)
#define SD_CMD_TYPE_MASK        (3 << 22)
#define SD_CMD_ISDATA		(1 << 21)
#define SD_CMD_IXCHK_EN		(1 << 20)
#define SD_CMD_CRCCHK_EN	(1 << 19)
#define SD_CMD_RSPNS_TYPE_NONE	0	       // For no response
#define SD_CMD_RSPNS_TYPE_136	(1 << 16)      // For response R2 (with CRC), 
                                               // R3,4 (no CRC)
#define SD_CMD_RSPNS_TYPE_48	(2 << 16)      // For responses R1, R5, R6, 
                                               // R7 (with CRC)
#define SD_CMD_RSPNS_TYPE_48B	(3 << 16)      // For responses R1b, R5b 
                                               // (with CRC)
#define SD_CMD_RSPNS_TYPE_MASK  (3 << 16)
#define SD_CMD_MULTI_BLOCK	(1 << 5)
